ИТ_Фирма/src/DataProcessors/ЗагрузкаПрайслистаИзФайлаXLSX/ЗагрузкаПрайслистаИзФайлаXLSX.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайслистаИзФайлаXLSX</name>
  <attributes>
    <name>Конрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ИТ_Фирма/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПродажиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/DataProcessors/ЗагрузкаПрайслистаИзФайлаXLSX/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьФайлАсинхронно();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	Диалог.Фильтр = "Excel-файлы|*.xlsx";

	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ПутьКФайлу = РезультатВыбора[0];

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФайл();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьФайл()

	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , Объект.ПутьКФайлу, УникальныйИдентификатор);
	ТекстВопроса = "Не все позиции существуют в справочнике. Продолжить создание документа?";
	ОтветыНаВопрос = Новый СписокЗначений;
	ОтветыНаВопрос.Добавить(1, "Не создавать документ");
	ОтветыНаВопрос.Добавить(2, "Создать номенклатуру");
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса,ОтветыНаВопрос);
	
	СоздатьДокумент(Объект.Конрагент, ОписаниеФайла.Адрес,  СогласоватьЦены, ОтветПользователя);	
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Конрагент, АдресФайла,  СогласоватьЦены, ОтветПользователя)

	Данные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Данные.Записать(ИмяПромежуточногоФайла);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяПромежуточногоФайла);

	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Конрагент;
	ДокументЦены.Комментарий = "Загружен из файла";

	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Для Сч = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 

		ИмяНоменклатуры = ТабличныйДокумент.Область(Сч, 1).Текст;
		Цена = ТабличныйДокумент.Область(Сч, 2).Текст;		
       	
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ИмяНоменклатуры);
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, ИмяНоменклатуры);
			Сообщение.Сообщить();			

			Если ОтветПользователя = 1 Тогда
				Возврат;
			ИначеЕсли ОтветПользователя = 2 Тогда 
				
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				НоваяНоменклатура.Наименование = ИмяНоменклатуры;
				НоваяНоменклатура.Записать();
				Номенклатура = НоваяНоменклатура.Ссылка;
			КонецЕсли;

		
		
		КонецЕсли;
		
		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ОписаниеТипаЧисло.ПривестиЗначение(Цена);	
		
	КонецЦикла;

	Если СогласоватьЦены = Истина Тогда
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
		ДокументЦены.Согласовано = Истина;
		
	Иначе
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;	
	УдалитьФайлы(ИмяПромежуточногоФайла);
КонецПроцедуры
